In [85]:
%matplotlib inline
import pandas as pd
import numpy as np

In [20]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [21]:
ls

All.ipynb           LICENSE.txt         Solutions-6.ipynb   sales2.csv
Exercises-1.ipynb   README.md           build/              script.txt
Exercises-2.ipynb   Solutions-1.ipynb   cheat-sheet.txt     style-notebook.css
Exercises-3.ipynb   Solutions-2.ipynb   data/               style-table.css
Exercises-4.ipynb   Solutions-3.ipynb   images/             youtube.png
Exercises-5.ipynb   Solutions-4.ipynb   requirements.sh*
Exercises-6.ipynb   Solutions-5.ipynb   sales1.csv

In [22]:
!pwd

/Users/jianglongli/Desktop/GA/pycon-pandas-tutorial

In [23]:
titles = pd.DataFrame.from_csv('data/titles.csv', index_col=None)
titles.head()

                                   title  year
0                       Angels' Shepherd  2015
1  Noiva da Noite - o Desejo de 7 Homens  1974
2                           To the Flame  2017
3                    Cao mang die xie ji  1966
4                              Funkytown  2011

In [24]:
titles.shape

(221104, 2)

In [205]:
cast = pd.DataFrame.from_csv('data/cast.csv', index_col=None)
cast.head()

                               title  year       name   type character   n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself NaN

In [26]:
cast.shape

(3445386, 6)

### How many movies are listed in the titles dataframe?

In [11]:
titles.shape

(221104, 2)

221104

### What are the earliest two films listed in the titles dataframe?

In [13]:
titles.head()

                                   title  year
0                       Angels' Shepherd  2015
1  Noiva da Noite - o Desejo de 7 Homens  1974
2                           To the Flame  2017
3                    Cao mang die xie ji  1966
4                              Funkytown  2011

In [16]:
titles.sort_values(by = 'year').head(2)

                                                 title  year
35128                                       Miss Jerry  1894
104030  Reproduction of the Corbett and Jeffries Fight  1899

### How many movies have the title "Hamlet"?

In [51]:
H = titles[titles['title'].isin(['Hamlet'])]
H.shape

(19, 2)

In [43]:
titles[titles['title'].str.contains('Hamlet', case = False)].shape

(56, 2)

    a = pd.Series(['a', 'adfaf', 'adfa','hsdhf'])
    a.str.contains()

19

### How many movies are titled "North by Northwest"?

In [47]:
titles[titles['title'].isin(['North by Northwest'])].shape

(1, 2)

In [49]:
titles[titles['title'].str.contains('north by northwest', case = False)]

                     title  year
146881  North by Northwest  1959

1

### When was the first movie titled "Hamlet" made?

In [55]:
H.sort_values(by = 'year').iloc[0, ]

title    Hamlet
year       1910
Name: 28273, dtype: object

1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [57]:
titles[titles.title == 'Treasure Island'].sort_values(by = 'year')

                  title  year
79821   Treasure Island  1918
37418   Treasure Island  1920
1752    Treasure Island  1934
45466   Treasure Island  1950
41751   Treasure Island  1972
32615   Treasure Island  1973
127881  Treasure Island  1985
48257   Treasure Island  1999

### How many movies were made in the year 1950?

In [58]:
titles[titles.year == 1950].shape

(1037, 2)

### How many movies were made in the year 1960?

In [59]:
titles[titles.year == 1960].shape

(1481, 2)

### How many movies were made from 1950 through 1959?

In [61]:
titles[ (titles.year <= 1959) & (titles.year >= 1950)].shape

(12235, 2)

### In what years has a movie titled "Batman" been released?

In [77]:
titles[titles['title'].str.lower() == 'batman']

         title  year
148825  Batman  1943
154680  Batman  1989

### How many roles were there in the movie "Inception"?

In [78]:
cast.head()

                               title  year       name   type character   n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself NaN

In [80]:
cast['type'].unique()

array(['actor', 'actress'], dtype=object)

In [91]:
cast[(cast['title'].str.lower() == 'inception') & (cast['year'] == 2010)]['character'].unique().size

54

In [92]:
cast[(cast['title'].str.lower() == 'inception') & (cast['year'] == 2010)].shape

(76, 6)

In [95]:
cht = cast[(cast['title'].str.lower() == 'inception') & (cast['year'] == 2010)]
cht.name.unique().size

76

In [90]:
a = pd.DataFrame(np.random.randint(6, size = 18).reshape(6,3), columns=list('ABC'))
b = a['A']
b.unique()

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [106]:
inception = cast[cast['title'].str.lower() == 'inception'].copy()
inception.head()

,title,year,name,type,character,n
89493,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
136001,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44
168277,Inception,2010,Tom Berenger,actor,Browning,8
181086,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
238395,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29

In [139]:
# inception[inception['n'] == np.nan].shape # why not working?
inception[inception['n'].isnull()].shape

(25, 6)

In [132]:
n = np.random.rand(3,3)
n[1,2] = np.nan
m = pd.DataFrame(n, columns=list('ABC'))
m[m['C'].isnull()]

Empty DataFrame
Columns: [A, B, C]
Index: []

### But how many roles in the movie "Inception" did receive an "n" value?

In [143]:
inception[-inception['n'].isnull()].shape

(51, 6)

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [149]:
nn = cast[cast['title'].str.lower() == 'north by northwest']
nn[-nn['n'].isnull()].sort_values(by = 'n')

,title,year,name,type,character,n
803392,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1
3208097,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2
1343001,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3
2887119,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4
328060,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5
2791418,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6
1562972,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7
1174789,North by Northwest,1959,Martin Landau,actor,Leonard,8
2253447,North by Northwest,1959,Adam Williams,actor,Valerian,9
1669504,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10
613651,North by Northwest,1959,Robert Ellenstein,actor,Licht,11
2113983,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12
427685,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13
1390700,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14
188864,North by Northwest,1959,Edward Binns,actor,Captain Junket,15
1276075,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [159]:
cast[(cast['title'].str.lower() == 'sleuth') & (cast['year'] == 1972)].sort_values(by = 'n')

,title,year,name,type,character,n
1572154,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1
300287,Sleuth,1972,Michael Caine,actor,Milo Tindle,2
344006,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3
1350564,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4
2502400,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5
1335298,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [160]:
cast[(cast['title'].str.lower() == 'sleuth') & (cast['year'] == 2007)].sort_values(by = 'n')

          title  year                 name     type          character   n
300288   Sleuth  2007        Michael Caine    actor             Andrew   1
1191875  Sleuth  2007             Jude Law    actor               Milo   2
1664503  Sleuth  2007        Harold Pinter    actor        Man on T.V.   3
238499   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V. NaN
344007   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler NaN
2502399  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke NaN
3077072  Sleuth  2007    Carmel O'Sullivan  actress             Maggie NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [166]:
cast[(cast['title'].str.contains('hamlet', case = False )) & (cast['year'] == 1921)]

          title  year                    name     type         character  n
6981     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9
422207   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2
511534   Hamlet  1921        Anton De Verdier    actor           Laertes  7
1047199  Hamlet  1921         Hans Junkermann    actor          Polonius  6
2012911  Hamlet  1921            Heinz Stieda    actor           Horatio  5
2187399  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4
2448677  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3
2803443  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8
3063452  Hamlet  1921            Asta Nielsen  actress            Hamlet  1

### How many roles were credited in Branagh’s 1996 Hamlet?

In [170]:
cast[(cast['title'].str.lower() == 'hamlet') & (cast['year'] == 1996) & (-cast['n'].isnull())].shape

(46, 6)

### How many "Hamlet" roles have been listed in all film credits through history?

In [171]:
cast[(cast['title'].str.lower() == 'hamlet') & (-cast['n'].isnull())].shape

(249, 6)

### How many people have played an "Ophelia"?

In [178]:
cast[cast['character'].str.lower() == 'ophelia']['name'].unique().size

99

### How many people have played a role called "The Dude"?

In [179]:
cast[cast['character'].str.lower() == 'the dude']['name'].unique().size

17

### How many people have played a role called "The Stranger"?

In [180]:
cast[cast['character'].str.lower() == 'the stranger']['name'].unique().size

200

### How many roles has Sidney Poitier played throughout his career?

In [181]:
cast[cast['name'] == 'Sidney Poitier'].shape

(43, 6)

### How many roles has Judi Dench played?

In [182]:
cast[cast['name'] == 'Judi Dench'].shape

(54, 6)

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [191]:
cast[(cast['name'] == 'Cary Grant') & (cast['n'] == 2) & 
     ( (1940 <= cast['year']) & (cast['year'] <= 1950))].sort_values(by = 'year')

                   title  year        name   type    character  n
803389  My Favorite Wife  1940  Cary Grant  actor         Nick  2
803399    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [193]:
cond1 = cast['name'] == 'Gary Grant'
cond2 = cast['n'] == 1
cond3 = (cast['year'] <= 1950) & (cast['year'] >= 1940)
cast[cond1 & cond2 & cond3]

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### How many roles were available for actors in the 1950s?

In [206]:
cond1 = (cast['year'] <= 1950) & (cast['year'] >= 1940)
cond2 = cast['type'] == 'actor'
cast[cond1 & cond2].shape

(175391, 6)

### How many roles were avilable for actresses in the 1950s?

In [207]:
cond1 = (cast['year'] <= 1950) & (cast['year'] >= 1940)
cond2 = cast['type'] == 'actress'
cast[cond1 & cond2].shape

(55847, 6)

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [214]:
cast[(cast['n'] == 1) & (cast['year'] <= 1980)].shape

(62721, 6)

### How many non-leading roles were available through from the beginning of film history through 1980?

In [215]:
cast[(cast['n'] != 1) & (cast['year'] <= 1980)].shape

(1074772, 6)

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [216]:
cast[(cast['n'].isnull()) & (cast['year'] <= 1980)].shape

(429322, 6)